#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.storage_layer.random_password.password: Refreshing state... [id=none][0m
[0m[1mmodule.resource_group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core][0m
[0m[1mmodule.vault_layer.data.azurerm_client_config.current_client: Reading...[0m[0m
[0m[1mmodule.storage_layer.data.azurerm_client_config.client_db: Reading...[0m[0m
[0m[1mmodule.vault_layer.data.azurerm_client_config.current_client: Read complete after 0s [id=2022-05-26 17:35:10.35421544 +0000 UTC][0m
[0m[1mmodule.storage_layer.data.azurerm_client_config.client_db: Read complete after 0s [id=2022-05-26 17:35:10.35392394 +0000 UTC][0m
[0m[1mmodule.storage_layer.azurerm_mssql_server.sqlserver: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Sql/servers/sql-dev-sunrise-core][0m
[0m[1mmodule.vault_layer.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.KeyVault/vaults/kv-dev-sunrise-core][0m
[0m[1mmodule.vault_layer.azurerm_key_vault_secret.secret_sql_admin_pass: Refreshing state... [id=https://kv-dev-sunrise-core.vault.azure.net/secrets/secret-dev-sunrise-core-mssql-admin-pass/7589242675b4420d9f8da90aa6ca021d][0m
[0m[1mmodule.vault_layer.azurerm_key_vault_secret.secret_sql_admin: Refreshing state... [id=https://kv-dev-sunrise-core.vault.azure.net/secrets/secret-dev-sunrise-core-mssql-admin/eb68e3647e5d46bea1f54749240540cc][0m
[0m[1mmodule.storage_layer.azurerm_mssql_database.sqldatabase: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Sql/servers/sql-dev-sunrise-core/databases/db-dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[0m
Terraform will perform the following actions:

[1m  # module.ingest_layer.azurerm_app_service_plan.asp[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_app_service_plan" "asp" {
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                         = "functionapp"
      [32m+[0m [0m[1m[0mlocation[0m[0m                     = "westeurope"
      [32m+[0m [0m[1m[0mmaximum_elastic_worker_count[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmaximum_number_of_workers[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                         = "asp-dev-ingest-sunrise-core"
      [32m+[0m [0m[1m[0mreserved[0m[0m                     = true
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m          = "rg-dev-sunrise-core"

      [32m+[0m [0msku {
          [32m+[0m [0m[1m[0mcapacity[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msize[0m[0m     = "Y1"
          [32m+[0m [0m[1m[0mtier[0m[0m     = "Dynamic"
        }
    }

[1m  # module.ingest_layer.azurerm_application_insights.appinsights[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_application_insights" "appinsights" {
      [32m+[0m [0m[1m[0mapp_id[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mapplication_type[0m[0m                      = "web"
      [32m+[0m [0m[1m[0mconnection_string[0m[0m                     = (sensitive value)
      [32m+[0m [0m[1m[0mdaily_data_cap_in_gb[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mdaily_data_cap_notifications_disabled[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdisable_ip_masking[0m[0m                    = false
      [32m+[0m [0m[1m[0mforce_customer_storage_for_profiler[0m[0m   = false
      [32m+[0m [0m[1m[0mid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0minstrumentation_key[0m[0m                   = (sensitive value)
      [32m+[0m [0m[1m[0minternet_ingestion_enabled[0m[0m            = true
      [32m+[0m [0m[1m[0minternet_query_enabled[0m[0m                = true
      [32m+[0m [0m[1m[0mlocal_authentication_disabled[0m[0m         = false
      [32m+[0m [0m[1m[0mlocation[0m[0m                              = "westeurope"
      [32m+[0m [0m[1m[0mname[0m[0m                                  = "appi-dev-ingest-sunrise-core"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                   = "rg-dev-sunrise-core"
      [32m+[0m [0m[1m[0mretention_in_days[0m[0m                     = 90
      [32m+[0m [0m[1m[0msampling_percentage[0m[0m                   = 100
    }

[1m  # module.ingest_layer.azurerm_function_app.function[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_function_app" "function" {
      [32m+[0m [0m[1m[0mapp_service_plan_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mapp_settings[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mclient_affinity_enabled[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mcustom_domain_verification_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mdefault_hostname[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0menable_builtin_logging[0m[0m          = true
      [32m+[0m [0m[1m[0menabled[0m[0m                         = true
      [32m+[0m [0m[1m[0mhttps_only[0m[0m                      = true
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mkey_vault_reference_identity_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                        = "westeurope"
      [32m+[0m [0m[1m[0mname[0m[0m                            = "func-dev-ingest-sunrise-core"
      [32m+[0m [0m[1m[0mos_type[0m[0m                         = "linux"
      [32m+[0m [0m[1m[0moutbound_ip_addresses[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_addresses[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m             = "rg-dev-sunrise-core"
      [32m+[0m [0m[1m[0msite_credential[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mstorage_account_access_key[0m[0m      = (sensitive value)
      [32m+[0m [0m[1m[0mstorage_account_name[0m[0m            = "sadevingest"
      [32m+[0m [0m[1m[0mstorage_connection_string[0m[0m       = (sensitive value)
      [32m+[0m [0m[1m[0mversion[0m[0m                         = "~3"

      [32m+[0m [0mauth_settings {
          [32m+[0m [0m[1m[0madditional_login_params[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mallowed_external_redirect_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_provider[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0missuer[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mruntime_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtoken_refresh_extension_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtoken_store_enabled[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0munauthenticated_client_action[0m[0m  = (known after apply)

          [32m+[0m [0mactive_directory {
              [32m+[0m [0m[1m[0mallowed_audiences[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mclient_id[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m     = (sensitive value)
            }

          [32m+[0m [0mfacebook {
              [32m+[0m [0m[1m[0mapp_id[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mapp_secret[0m[0m   = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m = (known after apply)
            }

          [32m+[0m [0mgoogle {
              [32m+[0m [0m[1m[0mclient_id[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m  = (known after apply)
            }

          [32m+[0m [0mmicrosoft {
              [32m+[0m [0m[1m[0mclient_id[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m  = (known after apply)
            }

          [32m+[0m [0mtwitter {
              [32m+[0m [0m[1m[0mconsumer_key[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mconsumer_secret[0m[0m = (sensitive value)
            }
        }

      [32m+[0m [0mconnection_string {
          [32m+[0m [0m[1m[0mname[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mvalue[0m[0m = (sensitive value)
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0midentity_ids[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0msite_config {
          [32m+[0m [0m[1m[0malways_on[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mapp_scale_limit[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mauto_swap_slot_name[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mdotnet_framework_version[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0melastic_instance_minimum[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mftps_state[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mhealth_check_path[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mhttp2_enabled[0m[0m                    = (known after apply)
          [32m+[0m [0m[1m[0mip_restriction[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mjava_version[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mlinux_fx_version[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mmin_tls_version[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mpre_warmed_instance_count[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mruntime_scale_monitoring_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mscm_ip_restriction[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mscm_type[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mscm_use_main_ip_restriction[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0muse_32_bit_worker_process[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mvnet_route_all_enabled[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mwebsockets_enabled[0m[0m               = (known after apply)

          [32m+[0m [0mcors {
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0msupport_credentials[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0msource_control {
          [32m+[0m [0m[1m[0mbranch[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mmanual_integration[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mrepo_url[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mrollback_enabled[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0muse_mercurial[0m[0m      = (known after apply)
        }
    }

[1m  # module.ingest_layer.azurerm_storage_account.sa[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_storage_account" "sa" {
      [32m+[0m [0m[1m[0maccess_tier[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0maccount_kind[0m[0m                      = "StorageV2"
      [32m+[0m [0m[1m[0maccount_replication_type[0m[0m          = "LRS"
      [32m+[0m [0m[1m[0maccount_tier[0m[0m                      = "Standard"
      [32m+[0m [0m[1m[0mallow_blob_public_access[0m[0m          = false
      [32m+[0m [0m[1m[0menable_https_traffic_only[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0minfrastructure_encryption_enabled[0m[0m = false
      [32m+[0m [0m[1m[0mis_hns_enabled[0m[0m                    = false
      [32m+[0m [0m[1m[0mlarge_file_share_enabled[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                          = "westeurope"
      [32m+[0m [0m[1m[0mmin_tls_version[0m[0m                   = "TLS1_0"
      [32m+[0m [0m[1m[0mname[0m[0m                              = "sadevingest"
      [32m+[0m [0m[1m[0mnfsv3_enabled[0m[0m                     = false
      [32m+[0m [0m[1m[0mprimary_access_key[0m[0m                = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_connection_string[0m[0m    = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_blob_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_connection_string[0m[0m         = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_dfs_endpoint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprimary_dfs_host[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_location[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_endpoint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_host[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mqueue_encryption_key_type[0m[0m         = "Service"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m               = "rg-dev-sunrise-core"
      [32m+[0m [0m[1m[0msecondary_access_key[0m[0m              = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_connection_string[0m[0m  = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_blob_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_connection_string[0m[0m       = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_dfs_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_dfs_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_location[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mshared_access_key_enabled[0m[0m         = true
      [32m+[0m [0m[1m[0mtable_encryption_key_type[0m[0m         = "Service"

      [32m+[0m [0mblob_properties {
          [32m+[0m [0m[1m[0mchange_feed_enabled[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mdefault_service_version[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mlast_access_time_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mversioning_enabled[0m[0m       = (known after apply)

          [32m+[0m [0mcontainer_delete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mdelete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mcustomer_managed_key {
          [32m+[0m [0m[1m[0mkey_vault_key_id[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0muser_assigned_identity_id[0m[0m = (known after apply)
        }

      [32m+[0m [0mnetwork_rules {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)

          [32m+[0m [0mprivate_link_access {
              [32m+[0m [0m[1m[0mendpoint_resource_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mendpoint_tenant_id[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mqueue_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mhour_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }

          [32m+[0m [0mlogging {
              [32m+[0m [0m[1m[0mdelete[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mread[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mwrite[0m[0m                 = (known after apply)
            }

          [32m+[0m [0mminute_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }
        }

      [32m+[0m [0mrouting {
          [32m+[0m [0m[1m[0mchoice[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mpublish_internet_endpoints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mpublish_microsoft_endpoints[0m[0m = (known after apply)
        }

      [32m+[0m [0mshare_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mretention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0msmb {
              [32m+[0m [0m[1m[0mauthentication_types[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mchannel_encryption_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mkerberos_ticket_encryption_type[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversions[0m[0m                        = (known after apply)
            }
        }
    }

[1m  # module.vault_layer.azurerm_key_vault.kv[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "azurerm_key_vault" "kv" {
      [33m~[0m [0m[1m[0maccess_policy[0m[0m                   = [
          [33m~[0m [0m{
              [33m~[0m [0mkey_permissions         = [
                  [31m-[0m [0m"Get",
                  [31m-[0m [0m"List",
                  [31m-[0m [0m"Update",
                  [31m-[0m [0m"Create",
                  [31m-[0m [0m"Import",
                  [31m-[0m [0m"Delete",
                  [31m-[0m [0m"Recover",
                  [31m-[0m [0m"Backup",
                  [31m-[0m [0m"Restore",
                  [31m-[0m [0m"GetRotationPolicy",
                  [31m-[0m [0m"SetRotationPolicy",
                  [31m-[0m [0m"Rotate",
                  [32m+[0m [0m"create",
                  [32m+[0m [0m"get",
                ]
              [33m~[0m [0msecret_permissions      = [
                  [31m-[0m [0m"Get",
                  [31m-[0m [0m"List",
                  [31m-[0m [0m"Set",
                  [31m-[0m [0m"Delete",
                  [31m-[0m [0m"Recover",
                  [31m-[0m [0m"Backup",
                  [31m-[0m [0m"Restore",
                  [32m+[0m [0m"set",
                  [32m+[0m [0m"get",
                  [32m+[0m [0m"delete",
                  [32m+[0m [0m"list",
                  [32m+[0m [0m"purge",
                  [32m+[0m [0m"recover",
                ]
                [90m# (5 unchanged elements hidden)[0m[0m
            },
          [31m-[0m [0m{
              [31m-[0m [0mapplication_id          = ""
              [31m-[0m [0mcertificate_permissions = []
              [31m-[0m [0mkey_permissions         = [
                  [31m-[0m [0m"Create",
                  [31m-[0m [0m"Get",
                ]
              [31m-[0m [0mobject_id               = "8aad2832-d5ed-4c40-82b1-f07139c6de09"
              [31m-[0m [0msecret_permissions      = [
                  [31m-[0m [0m"Set",
                  [31m-[0m [0m"Get",
                  [31m-[0m [0m"Delete",
                  [31m-[0m [0m"List",
                  [31m-[0m [0m"Purge",
                  [31m-[0m [0m"Recover",
                ]
              [31m-[0m [0mstorage_permissions     = []
              [31m-[0m [0mtenant_id               = "22e1763f-3ff7-4e44-ac06-7ce3e6b059ef"
            },
        ]
        [1m[0mid[0m[0m                              = "/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.KeyVault/vaults/kv-dev-sunrise-core"
        [1m[0mname[0m[0m                            = "kv-dev-sunrise-core"
        [1m[0mtags[0m[0m                            = {}
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[0m[1mPlan:[0m 4 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @fezepeda, Action: `pull_request`*